ylx167167/CrabMotor/Stm32MCU/Inc/main.h
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.h
 * @brief          : Header for main.c file.
 *                   This file contains the common defines of the application.
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2024 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under Ultimate Liberty license
 * SLA0044, the "License"; You may not use this file except in compliance with
 * the License. You may obtain a copy of the License at:
 *                             www.st.com/SLA0044
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stdint.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define IN_AM_Pin          GPIO_PIN_0
#define IN_AM_GPIO_Port    GPIOA
#define IN_AP_Pin          GPIO_PIN_1
#define IN_AP_GPIO_Port    GPIOA
#define IN_BM_Pin          GPIO_PIN_2
#define IN_BM_GPIO_Port    GPIOA
#define IN_BP_Pin          GPIO_PIN_3
#define IN_BP_GPIO_Port    GPIOA
#define LED1_Pin           GPIO_PIN_0
#define LED1_GPIO_Port     GPIOB
#define LED2_Pin           GPIO_PIN_1
#define LED2_GPIO_Port     GPIOB
#define LED3_Pin           GPIO_PIN_2
#define LED3_GPIO_Port     GPIOB
#define BUTTON1__Pin       GPIO_PIN_15
#define BUTTON1__GPIO_Port GPIOA
#define BUTTON1__EXTI_IRQn EXTI15_10_IRQn
#define BUTTON2__Pin       GPIO_PIN_3
#define BUTTON2__GPIO_Port GPIOB
#define BUTTON2__EXTI_IRQn EXTI3_IRQn
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
